<template>
  <div style="position: relative;z-index: 3;">
    <div class="pc">
      <div class="title-bar">
        <a href="/">首页 / </a>
        <span class="desc">隐私政策</span>
      </div>
      <div class="container">
        <div class="container-left">
          <div
            @click="setIndex(0)"
            :class="['tabs', activeIndex == 0 ? 'active' : '']"
          >
            用户协议
          </div>
          <div
            @click="setIndex(1)"
            :class="['tabs', activeIndex == 1 ? 'active' : '']"
          >
            隐私政策
          </div>
        </div>
        <div class="container-right" v-if="activeIndex == 0">
          <div class="title-right">
            <img src="../assets/images/policy/001.png" alt="" />
            <p>任礼游用户协议</p>
          </div>
          <div class="content-text">
            为使用任礼游平台（以下简称为“本平台”）提供的服务，您应当阅读并遵守《任礼游用户协议》（以下简称为“本协议”），请您充分理解并接受本协议后再注册使用本平台。本协议是您就注册、登录、使用任礼游平台及其他涉及的全部行为所订立的权利义务规范。您在注册过程中勾选“同意”等按钮、注册后登录和使用等行为，均表明您已完全充分理解、同意并接受本协议，愿意遵守本协议及任礼游平台公示的各项规则、规范的全部内容，若您不同意本协议或其中任何条款约定，您应立即停止注册、登录或使用任礼游平台。
            请您务必审慎阅读、充分理解各条款内容，特别是限制或免除责任的条款，以及开通或使用某项服务的单独协议、规则。限制或免责条款可能以加粗或加下划线的形式提示您重点注意。
            如果您代表您的公司或其他实体同意接受本协议的约束，则表示您声明并保证，您具有充分的合法授权，可使您的公司或此类实体受本协议的约束。您只有在且仅在获得必需的授权后，才可以代表您的公司或其他实体接受本协议及注册使用任礼游平台。
            为了使您更便捷地使用本平台的服务，您知悉并同意在注册本平台账户过程中，确认同意《隐私政策》。
            1、定义 如无特别说明，下列术语在本协议中的含义为： 1.1
            任礼游平台/任礼游：任礼游是一个全球开发者成长平台，为广告主和流量主提供智能、精准、高效的移动流量解决方案。
            1.2
            您/媒体/开发者：指在任礼游平台成功注册账户，具备使用任礼游平台提供服务所要求的相应资质和能力，拥有和/或运营移动应用、网站等产品的法人或其他组织。
            1.3
            开发者产品/媒体产品：指您合法拥有和/或经营的和/或运营的移动应用、网站、网页、小程序等。
            1.4
            最终用户：指为自身用途而非为转分发、转售之目的使用开发者产品的用户。
            1.5 任礼游平台服务/任礼游服务/本服务
            ：指任礼游通过本网站、任礼游平台根据本协议或与特定的任礼游服务相关的协议或补充条款向您提供的产品和服务，包括但不限于广告投放、赋能合作等。
            1.6
            任礼游协议：指在您使用任礼游服务时，您与任礼游所达成的本协议、签署的纸质或电子合同、使用某一特定服务时单独的服务协议、其他协议和平台规则等，统称为任礼游协议。
            2、协议主体
            本协议由通过登录本网站及其他方式使用本服务的用户与云袭网络技术河北有限公司（以下简称“我们”）共同签订。
            3、协议范围 3.1 本网站是由我们及我们关联公司提供的互联网产品和服务。
            3.2
            本用户协议是您与我们之间关于使用本网站服务所订立的协议，本协议条款的效力及于本网站所提供的一切产品和服务，用户在享受本网站任何单项服务时，应当受本协议的约束。
            3.3
            本协议项下的产品和服务是指由本网站发布的包括但不限于流量变现、用户增长、个性化配置等互联网产品和服务。
            3.4
            本协议内容同时包括《隐私政策》及所有本网站已经发布或未来可能发布的各类规则、公告或通知，且您在使用本网站某一特定产品或服务时，可能会
          </div>
        </div>
        <div class="container-right" v-else>
          <div class="title-right">
            <img src="../assets/images/policy/002.png" alt="" />
            <p>隐私政策</p>
          </div>
          <div class="content-text">
            任礼游平台及服务提供者云袭网络技术河北有限公司（以下称“我们”）非常重视用户的隐私和个人信息安全保护，我们将按照法律法规要求，采取相应安全保护措施，尽力保护您的个人信息安全可控。
            我们希望通过《隐私政策》（以下简称“本政策”）向您说明本网站如何收集、使用、处理与您有关的个人信息，以及您可以如何行使您的用户权利。
            特别提示：请您在使用本网站前，认真阅读并充分理解本《隐私政策》的全部内容，使用本网站提供的服务以您接受本政策为前提条件，如您在阅读过程中如您对本政策内容有任何疑问、意见或建议，请联系我们。
            需要特别说明的是，本政策不适用于第三方依托本网站向您提供的产品或服务，也不适用于本网站中已独立设置隐私政策的产品或服务。
            本隐私政策将帮助您了解： 本隐私政策将帮助您了解以下内容：
            1.我们如何收集和使用个人信息。 2.我们如何使用Cookie和同类技术。
            3.我们如何存储个人信息。 4.我们如何共享、转移、公开披露个人信息。
            5.我们如何保护个人信息。 6.未成年人使用条款。 7.用户权利
            8.本隐私政策如何更新和通知。 9.如何联系我们。
            我们深知个人信息对您的重要性，也深知为您的信息提供有效保护是我们业务健康可持续发展的基石。感谢您对我们的信任！我们致力于维持您对我们的信任，恪守适用法律和我们对您的承诺，尽全力保证您的个人信息安全和合理使用。同时，我们郑重承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
            1.我们如何收集和使用个人信息
            个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人/法人身份或者反映特定自然人/法人活动情况的各种信息。
            1.1我们提供服务时，可能会收集、储存和使用下列信息：
            1.1.1您在使用我们服务时主动提供的信息
            （1）您在注册账户或使用我们的服务时，向我们提供的可用于识别用户的个人身份的信息，例如姓名、电子邮件地址、电话号码、银行卡号、身份证号
          </div>
        </div>
      </div>
    </div>
    <div class="mobile">
      <div class="container">
        <div class="container-left">
          <div
            @click="setIndex(0)"
            :class="['tabs', activeIndex == 0 ? 'active' : '']"
          >
            用户协议
          </div>
          <div
            @click="setIndex(1)"
            :class="['tabs', activeIndex == 1 ? 'active' : '']"
          >
            隐私政策
          </div>
        </div>
        <div class="container-right" v-if="activeIndex == 0">
          <div class="title-right">
            <img src="../assets/images/policy/001.png" alt="" />
            <p>任礼游用户协议</p>
          </div>
          <div class="content-text">
            为使用任礼游平台（以下简称为“本平台”）提供的服务，您应当阅读并遵守《任礼游用户协议》（以下简称为“本协议”），请您充分理解并接受本协议后再注册使用本平台。本协议是您就注册、登录、使用任礼游平台及其他涉及的全部行为所订立的权利义务规范。您在注册过程中勾选“同意”等按钮、注册后登录和使用等行为，均表明您已完全充分理解、同意并接受本协议，愿意遵守本协议及任礼游平台公示的各项规则、规范的全部内容，若您不同意本协议或其中任何条款约定，您应立即停止注册、登录或使用任礼游平台。
            请您务必审慎阅读、充分理解各条款内容，特别是限制或免除责任的条款，以及开通或使用某项服务的单独协议、规则。限制或免责条款可能以加粗或加下划线的形式提示您重点注意。
            如果您代表您的公司或其他实体同意接受本协议的约束，则表示您声明并保证，您具有充分的合法授权，可使您的公司或此类实体受本协议的约束。您只有在且仅在获得必需的授权后，才可以代表您的公司或其他实体接受本协议及注册使用任礼游平台。
            为了使您更便捷地使用本平台的服务，您知悉并同意在注册本平台账户过程中，确认同意《隐私政策》。
            1、定义 如无特别说明，下列术语在本协议中的含义为： 1.1
            任礼游平台/任礼游：任礼游是一个全球开发者成长平台，为广告主和流量主提供智能、精准、高效的移动流量解决方案。
            1.2
            您/媒体/开发者：指在任礼游平台成功注册账户，具备使用任礼游平台提供服务所要求的相应资质和能力，拥有和/或运营移动应用、网站等产品的法人或其他组织。
            1.3
            开发者产品/媒体产品：指您合法拥有和/或经营的和/或运营的移动应用、网站、网页、小程序等。
            1.4
            最终用户：指为自身用途而非为转分发、转售之目的使用开发者产品的用户。
            1.5 任礼游平台服务/任礼游服务/本服务
            ：指任礼游通过本网站、任礼游平台根据本协议或与特定的任礼游服务相关的协议或补充条款向您提供的产品和服务，包括但不限于广告投放、赋能合作等。
            1.6
            任礼游协议：指在您使用任礼游服务时，您与任礼游所达成的本协议、签署的纸质或电子合同、使用某一特定服务时单独的服务协议、其他协议和平台规则等，统称为任礼游协议。
            2、协议主体
            本协议由通过登录本网站及其他方式使用本服务的用户与云袭网络技术河北有限公司（以下简称“我们”）共同签订。
            3、协议范围 3.1 本网站是由我们及我们关联公司提供的互联网产品和服务。
            3.2
            本用户协议是您与我们之间关于使用本网站服务所订立的协议，本协议条款的效力及于本网站所提供的一切产品和服务，用户在享受本网站任何单项服务时，应当受本协议的约束。
            3.3
            本协议项下的产品和服务是指由本网站发布的包括但不限于流量变现、用户增长、个性化配置等互联网产品和服务。
            3.4
            本协议内容同时包括《隐私政策》及所有本网站已经发布或未来可能发布的各类规则、公告或通知，且您在使用本网站某一特定产品或服务时，可能会
          </div>
        </div>
        <div class="container-right" v-else>
          <div class="title-right">
            <img src="../assets/images/policy/002.png" alt="" />
            <p>隐私政策</p>
          </div>
          <div class="content-text">
            任礼游平台及服务提供者云袭网络技术河北有限公司（以下称“我们”）非常重视用户的隐私和个人信息安全保护，我们将按照法律法规要求，采取相应安全保护措施，尽力保护您的个人信息安全可控。
            我们希望通过《隐私政策》（以下简称“本政策”）向您说明本网站如何收集、使用、处理与您有关的个人信息，以及您可以如何行使您的用户权利。
            特别提示：请您在使用本网站前，认真阅读并充分理解本《隐私政策》的全部内容，使用本网站提供的服务以您接受本政策为前提条件，如您在阅读过程中如您对本政策内容有任何疑问、意见或建议，请联系我们。
            需要特别说明的是，本政策不适用于第三方依托本网站向您提供的产品或服务，也不适用于本网站中已独立设置隐私政策的产品或服务。
            本隐私政策将帮助您了解： 本隐私政策将帮助您了解以下内容：
            1.我们如何收集和使用个人信息。 2.我们如何使用Cookie和同类技术。
            3.我们如何存储个人信息。 4.我们如何共享、转移、公开披露个人信息。
            5.我们如何保护个人信息。 6.未成年人使用条款。 7.用户权利
            8.本隐私政策如何更新和通知。 9.如何联系我们。
            我们深知个人信息对您的重要性，也深知为您的信息提供有效保护是我们业务健康可持续发展的基石。感谢您对我们的信任！我们致力于维持您对我们的信任，恪守适用法律和我们对您的承诺，尽全力保证您的个人信息安全和合理使用。同时，我们郑重承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
            1.我们如何收集和使用个人信息
            个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人/法人身份或者反映特定自然人/法人活动情况的各种信息。
            1.1我们提供服务时，可能会收集、储存和使用下列信息：
            1.1.1您在使用我们服务时主动提供的信息
            （1）您在注册账户或使用我们的服务时，向我们提供的可用于识别用户的个人身份的信息，例如姓名、电子邮件地址、电话号码、银行卡号、身份证号
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
const activeIndex = ref(0);

function setIndex(index) {
  activeIndex.value = index;
}
</script>

<style lang="scss" scoped>
@media (max-width: $mobile-width) {
  .pc {
    display: none !important;
  }
  .mobile {
    width: 100%;
    display: block !important;
  }
}
.pc {
  width: 100%;
  padding-top: 44px;
  padding-bottom: 30px;
  background: #f8f8f8;
  .title-bar {
    width: 1200px;
    min-width: 1200px;
    margin: 0 auto;
    padding-bottom: 20px;
    font-family: 思源黑体;
    font-size: 16px;
    font-weight: normal;
    line-height: 16px;
    .title {
      color: #666666;
    }
    .desc {
      color: #222222;
    }
  }
  .container {
    width: 1200px;
    height: 816px;
    min-width: 1200px;
    display: flex;
    margin: 0 auto;
    background: #ffffff;
    box-shadow: 1.5px 2.6px 30px 0px rgba(0, 0, 0, 0.12);
    .container-left {
      width: 160px;
      height: 100%;
      border-right: 1px solid #d8d8d8;
      .tabs {
        width: 100%;
        height: 40px;
        text-align: center;
        line-height: 40px;
        font-family: 思源黑体;
        font-size: 14px;
        font-weight: normal;
        color: #222222;
        cursor: pointer;
      }
      .active {
        color: #e65e24;
        background: #fdf7f2;
      }
    }
    .container-right {
      width: 1040px;
      padding: 58px 44px;
      .title-right {
        display: flex;
        margin-bottom: 26px;
        img {
          width: 36px;
          height: 36px;
          margin-right: 18px;
        }
        p {
          font-family: 思源黑体;
          font-size: 24px;
          font-weight: 500;
          line-height: 38px;
          color: #333333;
        }
      }
      .content-text {
        width: 956px;
        height: 678px;
        font-family: 思源黑体;
        font-size: 14px;
        color: #555555;
        overflow: auto;
      }
    }
  }
}
.mobile {
  display: none;
  width: 100%;
  padding-top: 20px;
  padding-bottom: 30px;
  background: #FFFFFF;
  .container {
    width: 100%;
    padding: 20px;
    .container-left {
      display: flex;
      .tabs {
        height: 40px;
        text-align: center;
        line-height: 40px;
        font-family: 思源黑体;
        font-size: 16px;
        font-weight: normal;
        color: #222222;
        cursor: pointer;
        margin-right: 14px;
        margin-bottom: 20px;
      }
      .active {
        color: #e65e24;
      }
    }
    .container-right {
      width: 100%;
      .title-right {
        display: flex;
        margin-bottom: 26px;
        img {
          width: 36px;
          height: 36px;
          margin-right: 18px;
        }
        p {
          font-family: 思源黑体;
          font-size: 18px;
          font-weight: 500;
          line-height: 38px;
          color: #333333;
        }
      }
      .content-text {
        font-family: 思源黑体;
        font-size: 14px;
        color: #555555;
        overflow: auto;
      }
    }
  }
}
</style>
